tap "aws/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "neovim/neovim"
tap "ngrok/ngrok"
tap "sanemat/font"
tap "weaveworks/tap"
brew "act"
brew "xz"
brew "libtiff"
brew "aws-iam-authenticator"
brew "bat"
brew "binutils"
brew "bottom"
brew "btop"
brew "bzip2"
brew "freetype"
brew "pycparser"
brew "cffi"
brew "chezmoi"
brew "cmake"
brew "direnv"
brew "dosfstools"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "fd"
brew "harfbuzz"
brew "libtool"
brew "openssl@1.1"
brew "fzf"
brew "gh"
brew "go"
brew "golangci-lint"
brew "graphviz"
brew "grep"
brew "guile"
brew "helm"
brew "htop"
brew "libomp", link: true
brew "iproute2mac"
brew "jq"
brew "jsonschema"
brew "kompose"
brew "lazygit"
brew "libfido2"
brew "llvm"
brew "mysql-client"
brew "nasm"
brew "neovim"
brew "nghttp2"
brew "node", link: false
brew "nodenv"
brew "peco"
brew "virtualenv"
brew "poetry"
brew "pstree"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.10"
brew "qemu"
brew "ripgrep"
brew "rustup"
brew "starship"
brew "t-rec"
brew "telnet"
brew "tfenv"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "wget"
brew "xsel"
brew "yarn"
brew "z"
brew "aws/tap/copilot-cli"
brew "sanemat/font/ricty"
brew "weaveworks/tap/eksctl", link: false
cask "alacritty"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "ngrok"
cask "wireshark-chmodbpf"
cask "xquartz"
vscode "adpyke.vscode-sql-formatter"
vscode "charliermarsh.ruff"
vscode "cocopon.iceberg-theme"
vscode "donjayamanne.githistory"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "matangover.mypy"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "rduvql.vscode-jumper"
vscode "redhat.vscode-yaml"
vscode "starkwang.markdown"
vscode "tamasfe.even-better-toml"
vscode "twxs.cmake"
vscode "vscodevim.vim"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
